eisup_2019_docmng_integration/src/InformationRegisters/СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям/СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Ведомость</name>
    <type>
      <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/СпособыВыплатыЗарплаты/СпособыВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВыплатыЗарплаты</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ЧерезКассу</name>
  </enumValues>
  <enumValues>
    <name>ЧерезБанк</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ЗарплатаКВыплатеОрганизаций/ЗарплатаКВыплатеОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗарплатаКВыплатеОрганизаций</name>
  <comment>(Регл)</comment>
  <basedOn>Document.ПремииРаботниковОрганизаций</basedOn>
  <basedOn>Document.РегистрацияРазовыхНачисленийРаботниковОрганизаций</basedOn>
  <basedOn>Document.НачислениеДивидендовОрганизаций</basedOn>
  <basedOn>Document.НДФЛВозвратНалога</basedOn>
  <basedOn>Document.НачислениеЕдиновременныхПособийЗаСчетФСС</basedOn>
  <registerRecords>AccumulationRegister.РасчетПервойПоловиныМесяца</registerRecords>
  <registerRecords>InformationRegister.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСРаботникамиОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСДепонентамиОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛРасчетыСБюджетом</registerRecords>
  <registerRecords>AccumulationRegister.ЗарплатаЗаМесяцОрганизаций</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыплаты</name>
    <type>
      <types>EnumRef.СпособыВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДнейНеВыплаты</name>
    <comment>Количество дней, на которые задержана выплата зарплаты</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерВыплаты</name>
    <type>
      <types>EnumRef.ХарактерВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.НачислениеЕдиновременныхПособийЗаСчетФСС</types>
      <types>DocumentRef.НачислениеДивидендовОрганизаций</types>
      <types>DocumentRef.НДФЛВозвратНалога</types>
      <types>DocumentRef.ПремииРаботниковОрганизаций</types>
      <types>DocumentRef.РегистрацияРазовыхНачисленийРаботниковОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительныйУчетУдержаний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Округление</name>
    <type>
      <types>EnumRef.СпособыОкругленияЗарплатыКВыплате</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыВыплатыЗарплаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>Физлицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыплаченностьЗарплаты</name>
      <type>
        <types>EnumRef.ВыплаченностьЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>КомпенсацияЗаЗадержкуЗарплаты</name>
      <comment>Компенсация за нарушение установленного срока выплаты зарплаты в соответствии со ст.236 Трудового Кодекса</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Авторасчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удержано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/CommonModules/ЗарплатаКВыплатеОрганизацийДополнительный/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// МЕТОДЫ ПОЛУЧЕНИЯ ДАННЫХ ДОКУМЕНТОВ

// Функция возвращает шапку документа ЗарплатаКВыплатеОрганизаций
//
// Параметры:
//  Ссылка  - документ-ссылка ЗарплатаКВыплате
//
// Возвращаемое значение:
//	Выборка с полями:
//		Организация
//		ПериодРегистрации
//		ХарактерВыплаты
//		СпособВыплаты
//
Функция ПолучитьДанныеДокумента(Ссылка) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Рубли", Константы.ВалютаРегламентированногоУчета.Получить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОрганизаций.Ссылка,
	|	ЗарплатаКВыплатеОрганизаций.ПометкаУдаления,
	|	ЗарплатаКВыплатеОрганизаций.Проведен,
	|	ЗарплатаКВыплатеОрганизаций.Организация,
	|	ЗарплатаКВыплатеОрганизаций.ПодразделениеОрганизации,
	|	ЗарплатаКВыплатеОрганизаций.ПериодРегистрации,
	|	ЗарплатаКВыплатеОрганизаций.ХарактерВыплаты,
	|	ЗарплатаКВыплатеОрганизаций.СпособВыплаты,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств = &Рубли
	|			ТОГДА ЗарплатаКВыплатеОрганизаций.Организация.ОсновнойБанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетОрганизации,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|			ТОГДА ЗарплатаКВыплатеОрганизаций.Банк
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|				И ЗарплатаКВыплатеОрганизаций.Банк.ОсновнойБанковскийСчет.ВалютаДенежныхСредств = &Рубли
	|			ТОГДА ЗарплатаКВыплатеОрганизаций.Банк.ОсновнойБанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетКонтрагента,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|			ТОГДА ЗарплатаКВыплатеОрганизаций.Банк.ИНН
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ИННПолучателя,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|			ТОГДА ЗарплатаКВыплатеОрганизаций.Банк.КПП
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КПППолучателя,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|			ТОГДА ВЫРАЗИТЬ(ЗарплатаКВыплатеОрганизаций.Банк.ОсновнойБанковскийСчет.ТекстКорреспондента КАК СТРОКА(300))
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ТекстПолучателя
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций КАК ЗарплатаКВыплатеОрганизаций
	|ГДЕ
	|	ЗарплатаКВыплатеОрганизаций.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции

// Функция возвращает сумму к выплате по документу ЗарплатаКВыплатеОрганизаций
//
// Параметры:
//  Ведомость  - документ-ссылка ЗарплатаКВыплате
//  ВыплаченностьЗарплаты - Перечисления.ВыплаченностьЗарплаты
//  ПлатежныйДокумент - если указать, то выплаты по этому документу не учитываются
//
// Возвращаемое значение:
//	СуммаКВыплате
//
Функция ПолучитьДанныеДляВыплаты(Ведомости, ВыплаченностьЗарплаты = Неопределено, ПлатежныйДокумент = Неопределено) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ведомости", Ведомости);
	Запрос.УстановитьПараметр("НеПроверятьВыплаченность", ВыплаченностьЗарплаты = Неопределено);
	Запрос.УстановитьПараметр("ВыплаченностьЗарплаты", ВыплаченностьЗарплаты);
	Запрос.УстановитьПараметр("ПоВсемРегистраторам", ПлатежныйДокумент = Неопределено);
	Запрос.УстановитьПараметр("ПлатежныйДокумент", ПлатежныйДокумент);

	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗарплатаКВыплатеЗарплата.Ссылка КАК Ведомость,
	|	ЗарплатаКВыплатеЗарплата.Физлицо КАК Физлицо,
	|	СУММА(ЗарплатаКВыплатеЗарплата.Сумма + ЗарплатаКВыплатеЗарплата.КомпенсацияЗаЗадержкуЗарплаты) КАК СуммаКВыплате
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК РанееВыплаченныеСуммы
	|		ПО ЗарплатаКВыплатеЗарплата.Ссылка = РанееВыплаченныеСуммы.Ведомость
	|			И ЗарплатаКВыплатеЗарплата.Физлицо = РанееВыплаченныеСуммы.Физлицо
	|			И (&ПоВсемРегистраторам
	|				ИЛИ РанееВыплаченныеСуммы.Регистратор <> &ПлатежныйДокумент)
	|ГДЕ
	|	ЗарплатаКВыплатеЗарплата.Ссылка В(&Ведомости)
	|	И РанееВыплаченныеСуммы.Физлицо ЕСТЬ NULL 
	|	И (&НеПроверятьВыплаченность
	|			ИЛИ ЗарплатаКВыплатеЗарплата.ВыплаченностьЗарплаты = &ВыплаченностьЗарплаты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплатеЗарплата.Ссылка,
	|	ЗарплатаКВыплатеЗарплата.Физлицо";

	Возврат Запрос.Выполнить().Выгрузить();;
	
КонецФункции
